spec/spec/SVWS/CoreServices/example_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:proc="http://bpc.ru/sv/processesWS/">
   <soapenv:Header/>
   <soapenv:Body>
      <proc:runProcessRequest>
         <proc:containerId>10001007</proc:containerId>
         <!--Zero or more repetitions:-->
         <proc:processParams>
            <proc:paramName>I_IS_STAT_MODE_DEF</proc:paramName>
            <proc:paramValue>0</proc:paramValue>
         </proc:processParams>
         <!--Optional:-->
         <proc:effectiveDate>2017-04-16T09:00:00</proc:effectiveDate>
      </proc:runProcessRequest>
   </soapenv:Body>
</soapenv:Envelope>
